Repository: creatubbles/ctb-api-swift
Catalog: CreatubblesAPIClient/Resources/Localizations/*.lproj/Localizable.strings
Languages: it, ja

# error_invalid_response_detail
source: Response from the server is invalid.
ja: サーバーからの応答が無効です。

# error_missing_response_detail
source: Response from the server is missing or cannot be parsed.
ja: サーバーからの応答がないか、サーバーからの応答をパースできません。

# error_missing_response_title
source: Missing response
ja: 応答がありません

# error_invalid_response_title
source: Invalid response
ja: 無効な応答

# error_auth_failed_title
source: Authentication failed
it: Autenticazione non riuscita
ja: 認証に失敗しました

# error_auth_failed_detail
source: No more details are available at the moment. Please try again.
it: Nessun ulteriore dettaglio disponibile al momento. Riprova.
ja: 現在その他の詳細情報はご利用いただけません。もう一度お試しください。

# error_upload_cancelled_title
source: Upload cancelled
it: Caricamento annullato
ja: アップロードがキャンセルされました

# error_upload_cancelled_detail
source: Your creation upload was cancelled. Please re-upload again or add a new creation.
it: Il caricamento della tua creazione è stato annullato. Riprova o aggiungi una nuova creazione.
ja: あなたの作品のアップロードがキャンセルされました。再度アップロードするか、新しい作品を追加してください。

# error_auth_invalidURLComponents
source: Failed to create URL from components: %@
it: Impossibile creare URL dai componenti: %@
ja: 次のコンポーネントからのURL作成に失敗しました: %@

# error_auth_noClientId
source: Client id not set
it: ID client non impostato
ja: クライアントIDが設定されていません

# error_auth_noClientSecret
source: Client secret not set
it: Segreto client non impostato
ja: クライアントの秘密が設定されていません

# error_auth_noRedirectURL
source: Redirect URL not set
it: URL di reindirizzamento non impostato
ja: リダイレクトURLが設定されていません

# error_auth_noUsername
source: No username
it: Nessun nome utente
ja: ユーザー名がありません

# error_auth_noPassword
source: No password
it: Nessuna password
ja: パスワードがありません

# error_auth_alreadyAuthorizing
source: The client is already authorizing, wait for it to finish or abort authorization before trying again
it: Il client sta già autorizzando: attendi il completamento dell'operazione o annullala prima di riprovare.
ja: クライアントが既に認証中です。完了するのを待つか、認証を中止してから再度お試しください

# error_auth_noAuthorizationContext
source: No authorization context present
it: Nessun contesto di autorizzazione presente
ja: 認証コンテキストがありません

# error_auth_invalidAuthorizationContext
source: Invalid authorization context
it: Contesto di autorizzazione non valido
ja: 無効な認証コンテキスト

# error_auth_invalidRedirectURL
source: Invalid redirect URL: %@
it: URL di reindirizzamento non valido: %@
ja: 無効なリダイレクトURL: %@

# error_auth_noRefreshToken
source: I don't have a refresh token, not trying to refresh
it: Non ho un token di aggiornamento, non sto provando ad aggiornare
ja: リフレッシュトークンを持っていません。リフレッシュしようとはしていません

# error_auth_noRegistrationURL
source: No registration URL defined
it: Nessun URL di registrazione definito
ja: 定義された登録URLがありません

# error_auth_notUsingTLS
source: You MUST use HTTPS/SSL/TLS
it: DEVI utilizzare HTTPS/SSL/TLS
ja: HTTPS/SSL/TLSを使用してください

# error_auth_unableToOpenAuthorizeURL
source: Cannot open authorize URL
it: Impossibile aprire l'URL di autorizzazione
ja: 認証URLを開けません

# error_auth_invalidRequest
source: The request is missing a required parameter, includes an invalid parameter value, includes a parameter more than once, or is otherwise malformed.
it: La richiesta non ha un parametro necessario, include un valore non valido del parametro, include un parametro più di una volta o è errato.
ja: リクエストに無効なパラメータ値が含まれている、同一パラメータが2回以上含まれている、形式が正しくない、または必要なパラメターが含まれていません。

# error_auth_requestCancelled
source: The request has been cancelled
it: La richiesta è stata annullata
ja: リクエストがキャンセルされました

# error_auth_noTokenType
source: No token type received, will not use the token
it: Nessun tipo di token ricevuto, nessun token verrà utilizzato
ja: 受信されたトークンタイプはありません。トークンを使用しません

# error_auth_noDataInResponse
source: No data in the response
it: Nessun dato nella risposta
ja: 応答にデータがありません

# error_auth_missingState
source: The state parameter was missing in the response
it: Il parametro di stato mancava nella risposta
ja: 応答にステートパラメータがありませんでした

# error_auth_invalidState
source: Invalid value of the state parameter
it: Il parametro di stato non è valido
ja: 無効なステートパラメータ値

# error_auth_jsonParserError
source: Error parsing JSON
it: Errore analisi JSON
ja: JSONのパース中にエラーが発生しました

# error_auth_utf8EncodeError
source: Failed to UTF-8 encode the given string
it: Impossibile codificare con UTF-8 la stringa
ja: 指定された文字列のUTF-8暗号化に失敗しました

# error_auth_utf8DecodeError
source: Failed to decode given data as a UTF-8 string
it: Impossibile decodificare i dati come stringa UTF-8
ja: 指定されたデータをUTF-8文字列として暗号化できませんでした

# error_auth_unauthorizedClient
source: The client is not authorized to request an access token using this method.
it: Il client non è autorizzato a richiedere un token di accesso con questo metodo.
ja: クライアントにはこの方法を使用してアクセストークンをリクエストする権限がありません。

# error_auth_forbidden
source: Forbidden
it: Non consentito
ja: 禁止されています

# error_auth_wrongUsernamePassword
source: The username or password is incorrect
it: Il nome utente o la password non sono corretti
ja: ユーザー名またはパスワードが正しくありません

# error_auth_accessDenied
source: The resource owner or authorization server denied the request.
it: Il proprietario delle risorse o il server di autorizzazione ha negato la richiesta.
ja: リソースの所有者または認可サーバがリクエストを拒否しました。

# error_auth_unsupportedResponseType
source: The authorization server does not support obtaining an access token using this method.
it: Il server di autorizzazione non supporta il recupero di un token di accesso con questo metodo.
ja: 認可サーバーはこの方法を使用したアクセストークン取得に対応していません。

# error_auth_invalidScope
source: The requested scope is invalid, unknown, or malformed.
it: L'ambito richiesto è invalido, sconosciuto o errato.
ja: リクエストされた範囲は無効、不明、または不正な形式です。

# error_auth_serverError
source: The authorization server encountered an unexpected condition that prevented it from fulfilling the request.
it: Il server di autorizzazione ha riscontrato una condizione imprevista che ha impedito di soddisfare la richiesta.
ja: 認可サーバーがリクエスト実行を妨げる予期しない状態に遭遇しました。

# error_auth_temporarilyUnavailable
source: The authorization server is currently unable to handle the request due to a temporary overloading or maintenance of the server.
it: Il server di autorizzazione non è attualmente in grado di elaborare la richiesta a causa di temporaneo sovraccarico o manutenzione del server.
ja: 認可サーバーは現在、サーバーの一時的な過負荷またはメンテナンスのためにリクエストを処理することができなくなっています。
